examples/flows/compiled/if_no_else/flow.dot
digraph "if_no_else_flow" {
    rankdir=TB;
    node [shape=box, style=filled, fontname="Helvetica"];

    handler_setup [label="handler_setup", fillcolor=lightblue];
    handler_true [label="handler_true", fillcolor=palegreen];
    router_if_no_else_flow_line_14_if_1 [label="router_if_no_else_flow_line_14_if_1", fillcolor=wheat];
    start_if_no_else_flow [label="start_if_no_else_flow", fillcolor=palegreen];

    start_if_no_else_flow -> handler_setup;
    handler_setup -> router_if_no_else_flow_line_14_if_1;
    router_if_no_else_flow_line_14_if_1 -> handler_true [label="p['condition']"];
}
